/******************************************************************************\
 *                   © ViVuDi 2025. All rights reserved.                      *
 ******************************************************************************
 *  File        : Chứa regex sử dụng cho toàn app                             *
 *  Author      : Minh Nhat                                                   *
 *  Created     : 19/06/2025                                                  *
 *  Updated by  :                                                             *
 *  Modified    :                                                             *
\******************************************************************************/

/****************************************************************************
 * Regex cho toàn bộ ứng dụng                                               *
 ****************************************************************************/
export const REGEX = {
    /****************************************************************************
     * Regex dùng cho email                                                     *
     * @description                                                             *
     * - Chấp nhận các ký tự chữ cái, số, dấu chấm, gạch ngang, dấu + và %      *
     * - Phải có ký tự '@' và một tên miền hợp lệ sau đó                        *
     * - Tên miền phải có ít nhất 2 ký tự và có thể bao gồm dấu chấm            *
     ****************************************************************************/
    REGEX_EMAIL: /^[a-zA-Z0-9._%+-]+@[a-zA-Z0-9.-]+\.[a-zA-Z]{2,}$/u,
    /****************************************************************************
     * Regex dùng cho mật khẩu                                                  *
     * @description                                                             *
     * - Phải có ít nhất 8 ký tự                                                *
     * - Phải có ít nhất một chữ cái viết hoa, một chữ cái viết thường, một số  *
     * và một ký tự đặc biệt                                                    *
     * - Không cho phép khoảng trắng                                            *
     ****************************************************************************/
    REGEX_PASSWORD: /^(?=.*[a-z])(?=.*[A-Z])(?=.*\d)(?=.*[@$!%*?&])[A-Za-z\d@$!%*?&]{8,}$/,
    /****************************************************************************
     * Regex dùng cho mã OTP                                                    *
     * @description                                                             *
     * - Phải là 6 chữ số từ 0 đến 9                                            *
     * - Không cho phép ký tự khác ngoài số                                     *
     ****************************************************************************/
    REGEX_OTP: /^\d{6}$/,
    /****************************************************************************
     * Regex dùng cho số điện thoại                                             *
     * @description                                                             *
     * - Phải là 10 chữ số từ 0 đến 9                                           *
     * - Không cho phép ký tự khác ngoài số                                     *
     ****************************************************************************/
    REGEX_PHONE: /^[0-9]{10}$/,
    /****************************************************************************
     * Regex chỉ chấp nhận ASCII character                                      *
     * @description                                                             *
     * - Chỉ cho phép các ký tự từ 0 đến 127 trong bảng mã ASCII                *
     * - Không cho phép ký tự Unicode hoặc ký tự đặc biệt ngoài ASCII           *
     ****************************************************************************/
    REGEX_ONLY_ASCII: /^[\x00-\x7F]+$/,
    /****************************************************************************
     * Regex yêu cầu nhập ít nhất 8 ký tự                                       *
     ****************************************************************************/
    REGEX_MIN_LENGTH: /^.{8,}$/,
    /****************************************************************************
     * Regex yêu cầu ít nhất một chữ cái viết hoa                               *
     ****************************************************************************/
    REGEX_ONE_UPPER: /[A-Z]/,
    /****************************************************************************
     * Regex yêu cầu ít nhất một chữ cái viết thường                            *
     ****************************************************************************/
    REGEX_ONE_LOWER: /[a-z]/,
    /****************************************************************************
     * Regex yêu cầu ít nhất một chữ số                                         *
     ****************************************************************************/
    REGEX_ONE_DIGIT: /\d/,
    /****************************************************************************
     * Regex yêu cầu ít nhất một ký tự đặc biệt                                 *
     * @description                                                             *
     * - Chấp nhận các ký tự đặc biệt như @, $, !, %, *, ?, &                   *
     ****************************************************************************/
    REGEX_ONE_SPECIAL: /[@$!%*?&]/,
    /****************************************************************************
     * Regex không cho phép khoảng trắng                                        *
     * @description                                                             *
     * - Chỉ cho phép các ký tự không phải khoảng trắng                         *
     ****************************************************************************/
    REGEX_NO_WHITESPACE: /^\S*$/,
};