/****************************************************************************\
 *                   © ViVuDi 2025. All rights reserved.                    *
 ****************************************************************************
 *  File        : Chứa types sử dụng trong ThemedText                       *
 *  Author      : Minh Nhat                                                 *
 *  Created     : 07/06/2025                                                *
 *  Updated by  :                                                           *
 *  Modified    :                                                           *
\****************************************************************************/

import { type TextProps } from 'react-native';


/****************************************************************************
* ThemedTextType: Các kiểu hiển thị cho ThemedText                          *
* - 'default': Văn bản mặc định                                             *
* - 'title': Tiêu đề                                                        *
* - 'defaultSemiBold': Văn bản mặc định đậm vừa                             *
* - 'subtitle': Phụ đề                                                      *
* - 'link': Liên kết                                                        *
****************************************************************************/
export type ThemedTextType =
    | 'default'
    | 'title'
    | 'defaultSemiBold'
    | 'subtitle'
    | 'link';

/****************************************************************************
* ThemedTextProps: Thuộc tính cho component ThemedText                      *
****************************************************************************/
export type ThemedTextProps = TextProps & {
    /****************************************************************************
     * Màu sắc cho chế độ sáng                                                  *
     * @optional                                                                *
     ****************************************************************************/
    lightColor?: string;
    /****************************************************************************
     * Màu sắc cho chế độ tối                                                   *
     * @optional                                                                *
     ****************************************************************************/
    darkColor?: string;
    /****************************************************************************
     * Kiểu hiển thị của ThemedText                                             *
     * @optional                                                                *
     ****************************************************************************/
    type?: ThemedTextType;
};