/******************************************************************************\
 *                   © ViVuDi 2025. All rights reserved.                      *
 ******************************************************************************
 *  File        : DTO cho /auth/login                                         *
 *  Author      : Minh Nhật                                                   *
 *  Created     : 13/06/2025                                                  *
 *  Updated by  :                                                             *
 *  Modified    :                                                             *
\******************************************************************************/

/******************************************************************************
 * DTO cho đăng nhập người dùng                                               *
 ******************************************************************************/
export class LoginDTO {
    /****************************
     * Email đăng nhập          *
     * {REGEX_EMAIL}            *
     * {REGEX_ONLY_ASCII}       *
     ****************************/
    public email!: string;
    /****************************
     * Mật khẩu đăng nhập       *
     * {REGEX_PASSWORD}         *
     * {REGEX_ONLY_ASCII}       *
     ****************************/
    public password!: string;

    constructor() {
        this.email = '';
        this.password = '';
    };
};

/******************************************************************************
 * DTO cho phản hồi đăng nhập người dùng                                      *
 ******************************************************************************/
export class LoginResponseDTO {
    /****************************
     * Token đăng nhập          *
     * {REGEX_TOKEN}            *
     ****************************/
    public token!: string;

    constructor() {
        this.token = '';
    };
};